{"format": "layers-model", "generatedBy": "keras v2.2.5", "convertedBy": "TensorFlow.js Converter v1.1.2", "modelTopology": {"keras_version": "2.2.5", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "image", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 368, 368, 3], "dtype": "float32", "sparse": false, "name": "image"}, "inbound_nodes": []}, {"name": "MobilenetV1/Conv2d_0", "class_name": "Conv2D", "config": {"name": "MobilenetV1/Conv2d_0", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["image", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_0BatchNorm", "class_name": "BatchNormalization", "config": {"name": "MobilenetV1/Conv2d_0BatchNorm", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_0", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_1_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "MobilenetV1/Conv2d_1_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_0BatchNorm", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_1_pointwise", "class_name": "Conv2D", "config": {"name": "MobilenetV1/Conv2d_1_pointwise", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_1_depthwise", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_1BatchNorm", "class_name": "BatchNormalization", "config": {"name": "MobilenetV1/Conv2d_1BatchNorm", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_1_pointwise", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_2_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "MobilenetV1/Conv2d_2_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_1BatchNorm", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_2_pointwise", "class_name": "Conv2D", "config": {"name": "MobilenetV1/Conv2d_2_pointwise", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_2_depthwise", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_2BatchNorm", "class_name": "BatchNormalization", "config": {"name": "MobilenetV1/Conv2d_2BatchNorm", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_2_pointwise", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_3_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "MobilenetV1/Conv2d_3_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_2BatchNorm", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_3_pointwise", "class_name": "Conv2D", "config": {"name": "MobilenetV1/Conv2d_3_pointwise", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_3_depthwise", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_3BatchNorm", "class_name": "BatchNormalization", "config": {"name": "MobilenetV1/Conv2d_3BatchNorm", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_3_pointwise", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_4_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "MobilenetV1/Conv2d_4_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_3BatchNorm", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_4_pointwise", "class_name": "Conv2D", "config": {"name": "MobilenetV1/Conv2d_4_pointwise", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_4_depthwise", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_4BatchNorm", "class_name": "BatchNormalization", "config": {"name": "MobilenetV1/Conv2d_4BatchNorm", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_4_pointwise", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_5_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "MobilenetV1/Conv2d_5_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_4BatchNorm", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_5_pointwise", "class_name": "Conv2D", "config": {"name": "MobilenetV1/Conv2d_5_pointwise", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_5_depthwise", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_5BatchNorm", "class_name": "BatchNormalization", "config": {"name": "MobilenetV1/Conv2d_5BatchNorm", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_5_pointwise", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_6_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "MobilenetV1/Conv2d_6_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_5BatchNorm", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_6_pointwise", "class_name": "Conv2D", "config": {"name": "MobilenetV1/Conv2d_6_pointwise", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_6_depthwise", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_6BatchNorm", "class_name": "BatchNormalization", "config": {"name": "MobilenetV1/Conv2d_6BatchNorm", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_6_pointwise", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_8_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "MobilenetV1/Conv2d_8_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_6BatchNorm", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_8_pointwise", "class_name": "Conv2D", "config": {"name": "MobilenetV1/Conv2d_8_pointwise", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_8_depthwise", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_8BatchNorm", "class_name": "BatchNormalization", "config": {"name": "MobilenetV1/Conv2d_8BatchNorm", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_8_pointwise", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_9_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "MobilenetV1/Conv2d_9_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_8BatchNorm", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_9_pointwise", "class_name": "Conv2D", "config": {"name": "MobilenetV1/Conv2d_9_pointwise", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_9_depthwise", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_9BatchNorm", "class_name": "BatchNormalization", "config": {"name": "MobilenetV1/Conv2d_9BatchNorm", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_9_pointwise", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_10_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "MobilenetV1/Conv2d_10_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_9BatchNorm", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_10_pointwise", "class_name": "Conv2D", "config": {"name": "MobilenetV1/Conv2d_10_pointwise", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_10_depthwise", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_10BatchNorm", "class_name": "BatchNormalization", "config": {"name": "MobilenetV1/Conv2d_10BatchNorm", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_10_pointwise", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_7_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "MobilenetV1/Conv2d_7_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_6BatchNorm", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_11_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "MobilenetV1/Conv2d_11_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_10BatchNorm", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_7_pointwise", "class_name": "Conv2D", "config": {"name": "MobilenetV1/Conv2d_7_pointwise", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_7_depthwise", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_11_pointwise", "class_name": "Conv2D", "config": {"name": "MobilenetV1/Conv2d_11_pointwise", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_11_depthwise", 0, 0, {}]]]}, {"name": "Conv2d_3_pool", "class_name": "MaxPooling2D", "config": {"name": "Conv2d_3_pool", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["MobilenetV1/Conv2d_3BatchNorm", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_7BatchNorm", "class_name": "BatchNormalization", "config": {"name": "MobilenetV1/Conv2d_7BatchNorm", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_7_pointwise", 0, 0, {}]]]}, {"name": "MobilenetV1/Conv2d_11BatchNorm", "class_name": "BatchNormalization", "config": {"name": "MobilenetV1/Conv2d_11BatchNorm", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["MobilenetV1/Conv2d_11_pointwise", 0, 0, {}]]]}, {"name": "feat_concat", "class_name": "Concatenate", "config": {"name": "feat_concat", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["Conv2d_3_pool", 0, 0, {}], ["MobilenetV1/Conv2d_7BatchNorm", 0, 0, {}], ["MobilenetV1/Conv2d_11BatchNorm", 0, 0, {}]]]}, {"name": "Openpose/MConv_Stage1_L1_1_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "Openpose/MConv_Stage1_L1_1_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["feat_concat", 0, 0, {}]]]}, {"name": "Openpose/MConv_Stage1_L2_1_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "Openpose/MConv_Stage1_L2_1_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["feat_concat", 0, 0, {}]]]}, {"name": "Openpose/MConv_Stage1_L1_1_pointwise", "class_name": "Conv2D", "config": {"name": "Openpose/MConv_Stage1_L1_1_pointwise", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Openpose/MConv_Stage1_L1_1_depthwise", 0, 0, {}]]]}, {"name": "Openpose/MConv_Stage1_L2_1_pointwise", "class_name": "Conv2D", "config": {"name": "Openpose/MConv_Stage1_L2_1_pointwise", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Openpose/MConv_Stage1_L2_1_depthwise", 0, 0, {}]]]}, {"name": "Openpose/MConv_Stage1_L1_1BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Openpose/MConv_Stage1_L1_1BatchNorm", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Openpose/MConv_Stage1_L1_1_pointwise", 0, 0, {}]]]}, {"name": "Openpose/MConv_Stage1_L2_1BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Openpose/MConv_Stage1_L2_1BatchNorm", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Openpose/MConv_Stage1_L2_1_pointwise", 0, 0, {}]]]}, {"name": "Openpose/MConv_Stage1_L1_2_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "Openpose/MConv_Stage1_L1_2_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["Openpose/MConv_Stage1_L1_1BatchNorm", 0, 0, {}]]]}, {"name": "Openpose/MConv_Stage1_L2_2_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "Openpose/MConv_Stage1_L2_2_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["Openpose/MConv_Stage1_L2_1BatchNorm", 0, 0, {}]]]}, {"name": "Openpose/MConv_Stage1_L1_2_pointwise", "class_name": "Conv2D", "config": {"name": "Openpose/MConv_Stage1_L1_2_pointwise", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Openpose/MConv_Stage1_L1_2_depthwise", 0, 0, {}]]]}, {"name": "Openpose/MConv_Stage1_L2_2_pointwise", "class_name": "Conv2D", "config": {"name": "Openpose/MConv_Stage1_L2_2_pointwise", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Openpose/MConv_Stage1_L2_2_depthwise", 0, 0, {}]]]}, {"name": "Openpose/MConv_Stage1_L1_2BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Openpose/MConv_Stage1_L1_2BatchNorm", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Openpose/MConv_Stage1_L1_2_pointwise", 0, 0, {}]]]}, {"name": "Openpose/MConv_Stage1_L2_2BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Openpose/MConv_Stage1_L2_2BatchNorm", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Openpose/MConv_Stage1_L2_2_pointwise", 0, 0, {}]]]}, {"name": "Openpose/MConv_Stage1_L1_3_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "Openpose/MConv_Stage1_L1_3_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["Openpose/MConv_Stage1_L1_2BatchNorm", 0, 0, {}]]]}, {"name": "Openpose/MConv_Stage1_L2_3_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "Openpose/MConv_Stage1_L2_3_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["Openpose/MConv_Stage1_L2_2BatchNorm", 0, 0, {}]]]}, {"name": "Openpose/MConv_Stage1_L1_3_pointwise", "class_name": "Conv2D", "config": {"name": "Openpose/MConv_Stage1_L1_3_pointwise", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Openpose/MConv_Stage1_L1_3_depthwise", 0, 0, {}]]]}, {"name": "Openpose/MConv_Stage1_L2_3_pointwise", "class_name": "Conv2D", "config": {"name": "Openpose/MConv_Stage1_L2_3_pointwise", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Openpose/MConv_Stage1_L2_3_depthwise", 0, 0, {}]]]}, {"name": "Openpose/MConv_Stage1_L1_3BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Openpose/MConv_Stage1_L1_3BatchNorm", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Openpose/MConv_Stage1_L1_3_pointwise", 0, 0, {}]]]}, {"name": "Openpose/MConv_Stage1_L2_3BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Openpose/MConv_Stage1_L2_3BatchNorm", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Openpose/MConv_Stage1_L2_3_pointwise", 0, 0, {}]]]}, {"name": "Openpose/MConv_Stage1_L1_4_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "Openpose/MConv_Stage1_L1_4_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["Openpose/MConv_Stage1_L1_3BatchNorm", 0, 0, {}]]]}, {"name": "Openpose/MConv_Stage1_L2_4_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "Openpose/MConv_Stage1_L2_4_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["Openpose/MConv_Stage1_L2_3BatchNorm", 0, 0, {}]]]}, {"name": "Openpose/MConv_Stage1_L1_4_pointwise", "class_name": "Conv2D", "config": {"name": "Openpose/MConv_Stage1_L1_4_pointwise", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Openpose/MConv_Stage1_L1_4_depthwise", 0, 0, {}]]]}, {"name": "Openpose/MConv_Stage1_L2_4_pointwise", "class_name": "Conv2D", "config": {"name": "Openpose/MConv_Stage1_L2_4_pointwise", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Openpose/MConv_Stage1_L2_4_depthwise", 0, 0, {}]]]}, {"name": "Openpose/MConv_Stage1_L1_4BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Openpose/MConv_Stage1_L1_4BatchNorm", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Openpose/MConv_Stage1_L1_4_pointwise", 0, 0, {}]]]}, {"name": "Openpose/MConv_Stage1_L2_4BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Openpose/MConv_Stage1_L2_4BatchNorm", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Openpose/MConv_Stage1_L2_4_pointwise", 0, 0, {}]]]}, {"name": "Openpose/MConv_Stage1_L1_5_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "Openpose/MConv_Stage1_L1_5_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["Openpose/MConv_Stage1_L1_4BatchNorm", 0, 0, {}]]]}, {"name": "Openpose/MConv_Stage1_L2_5_depthwise", "class_name": "DepthwiseConv2D", "config": {"name": "Openpose/MConv_Stage1_L2_5_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["Openpose/MConv_Stage1_L2_4BatchNorm", 0, 0, {}]]]}, {"name": "Openpose/MConv_Stage1_L1_5_pointwise", "class_name": "Conv2D", "config": {"name": "Openpose/MConv_Stage1_L1_5_pointwise", "trainable": true, "dtype": "float32", "filters": 38, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Openpose/MConv_Stage1_L1_5_depthwise", 0, 0, {}]]]}, {"name": "Openpose/MConv_Stage1_L2_5_pointwise", "class_name": "Conv2D", "config": {"name": "Openpose/MConv_Stage1_L2_5_pointwise", "trainable": true, "dtype": "float32", "filters": 22, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": 